package jp.tmkworks.tmk_investment.marketdata.domain.model.jquants.株価;

public class 株価四本値調整Converter {

//  public List<株価四本値> convert(調整前株価四本値List 調整前List) {
//    var 調整後List = new CopyOnWriteArrayList<株価四本値>();
//
//    var 銘柄コードList = 調整前List.to銘柄コードList();
//    銘柄コードList.stream()
//        .forEach(銘柄コード -> {
//          var 銘柄調整前List = 調整前List.selectOrderBy日付降順(銘柄コード);
//
//          var 累積調整係数 = 調整係数.one();
//          for (var 調整前 : 銘柄調整前List) {
//            var 始値 = 調整前.始値();
//            var 高値 = 調整前.高値();
//            var 安値 = 調整前.安値();
//            var 終値 = 調整前.終値();
//            var 出来高 = 調整前.出来高();
//
////            var 調整済始値 = 累積調整係数.株価を調整する(始値);
////            var 調整済高値 = 累積調整係数.株価を調整する(高値);
////            var 調整済安値 = 累積調整係数.株価を調整する(安値);
////            var 調整済終値 = 累積調整係数.株価を調整する(終値);
////            var 調整済出来高 = 累積調整係数.出来高を調整する(出来高);
////
////            var 調整済 = 株価四本値.builder()
////                .銘柄コード(調整前.銘柄コード())
////                .日付(調整前.日付())
////                .始値(始値)
////                .高値(高値)
////                .安値(安値)
////                .終値(終値)
////                .ストップ高(調整前.ストップ高())
////                .ストップ安(調整前.ストップ安())
////                .出来高(出来高)
////                .売買代金(調整前.売買代金())
////                .調整係数(調整前.調整係数())
////                .調整済始値(調整済始値)
////                .調整済高値(調整済高値)
////                .調整済安値(調整済安値)
////                .調整済終値(調整済終値)
////                .調整済出来高(調整済出来高)
////                .build();
////            調整後List.add(調整済);
////
////            var 対象日調整係数 = new 調整係数(調整前.調整係数());
////            累積調整係数 = 累積調整係数.累積する(対象日調整係数);
//          }
//        });
//
//    return 調整後List;
//  }

}
